openwch/ch32l103/EVT/EXAM/BLE/BLE_USB/APP/include/ch32f20x_usbfs_device.h
/* USB endpoint type and attributes */
#ifndef USB_ENDP_TYPE_MASK
#define USB_ENDP_DIR_MASK       0x80
#define USB_ENDP_ADDR_MASK      0x0F
#define USB_ENDP_TYPE_MASK      0x03
#define USB_ENDP_TYPE_CTRL      0x00
#define USB_ENDP_TYPE_ISOCH     0x01
#define USB_ENDP_TYPE_BULK      0x02
#define USB_ENDP_TYPE_INTER     0x03
#endif

#ifndef USB_DEVICE_ADDR
#define USB_DEVICE_ADDR             0x02
#endif
#ifndef DEFAULT_ENDP0_SIZE
#define DEFAULT_ENDP0_SIZE      8       /* default maximum packet size for endpoint 0 */
#endif
#ifndef MAX_PACKET_SIZE
#define MAX_PACKET_SIZE         64      /* maximum packet size */
#endif
#ifndef USB_BO_CBW_SIZE
#define USB_BO_CBW_SIZE             0x1F
#define USB_BO_CSW_SIZE             0x0D
#endif
#ifndef USB_BO_CBW_SIG0
#define USB_BO_CBW_SIG0         0x55
#define USB_BO_CBW_SIG1         0x53
#define USB_BO_CBW_SIG2         0x42
#define USB_BO_CBW_SIG3         0x43
#define USB_BO_CSW_SIG0         0x55
#define USB_BO_CSW_SIG1         0x53
#define USB_BO_CSW_SIG2         0x42
#define USB_BO_CSW_SIG3         0x53
#endif

#ifndef __PACKED
#define __PACKED            __attribute__((packed))
#endif


/* 控制性宏定义 */
#define USE_SYS_CLK        0
//#define USBFS_HOST         0
//#define USB_OTG            0

/******************************************************************************/
/* USBFS_FS DEVICE USB_CONTROL */
/* BASE USB_CTRL */
#define   USBFS_BASE_CTRL       (USBFS_FS->BASE_CTRL)  // USB base control
#define     USBFS_UC_HOST_MODE     0x80      // enable USB host mode: 0=device mode, 1=host mode
#define     USBFS_UC_LOW_SPEED     0x40      // enable USB low speed: 0=12Mbps, 1=1.5Mbps
#define     USBFS_UC_DEV_PU_EN     0x20      // USB device enable and internal pullup resistance enable
#define     USBFS_UC_SYS_CTRL_MASK 0x30
#define     USBFS_UC_SYS_CTRL0     0x00
#define     USBFS_UC_SYS_CTRL1     0x10
#define     USBFS_UC_SYS_CTRL2     0x20
#define     USBFS_UC_SYS_CTRL3     0x30
// UC_HOST_MODE & UC_SYS_CTRL1 & UC_SYS_CTRL0: USB system control
//   0 00: disable USB device and disable internal pullup resistance
//   0 01: enable USB device and disable internal pullup resistance, need external pullup resistance
//   0 1x: enable USB device and enable internal pullup resistance
//   1 00: enable USB host and normal status
//   1 01: enable USB host and force UDP/UDM output SE0 state
//   1 10: enable USB host and force UDP/UDM output J state
//   1 11: enable USB host and force UDP/UDM output resume or K state
#define     USBFS_UC_INT_BUSY      0x08      // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define     USBFS_UC_RESET_SIE     0x04      // force reset USB SIE, need software clear
#define     USBFS_UC_CLR_ALL       0x02      // force clear FIFO and count of USB
#define     USBFS_UC_DMA_EN        0x01      // DMA enable and DMA interrupt enable for USB
/* DEVICE USB_CTRL */
#define   USBFS_UDEV_CTRL        (USBFS_FS->UDEV_CTRL)  // USB device physical prot control
#define     USBFS_UD_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define     USBFS_UD_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define     USBFS_UD_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define     USBFS_UD_LOW_SPEED     0x04      // enable USB physical port low speed: 0=full speed, 1=low speed
#define     USBFS_UD_GP_BIT        0x02      // general purpose bit
#define     USBFS_UD_PORT_EN       0x01      // enable USB physical port I/O: 0=disable, 1=enable
/* USB INT EN */
#define   USBFS_INT_EN           (USBFS_FS->INT_EN)    // USB interrupt enable
#define     USBFS_UIE_DEV_NAK      0x40      // enable interrupt for NAK responded for USB device mode
#define     USBFS_UIE_FIFO_OV      0x10      // enable interrupt for FIFO overflow
#define     USBFS_UIE_HST_SOF      0x08      // enable interrupt for host SOF timer action for USB host mode
#define     USBFS_UIE_SUSPEND      0x04      // enable interrupt for USB suspend or resume event
#define     USBFS_UIE_TRANSFER     0x02      // enable interrupt for USB transfer completion
#define     USBFS_UIE_DETECT       0x01      // enable interrupt for USB device detected event for USB host mode
#define     USBFS_UIE_BUS_RST      0x01      // enable interrupt for USB bus reset event for USB device mode
/* USB_DEV_ADDR */
#define   USBFS_DEV_ADDR         (USBFS_FS->DEV_ADDR)   // USB device address
#define     USBFS_UDA_GP_BIT       0x80      // general purpose bit
#define     USBFS_USB_ADDR_MASK    0x7F      // bit mask for USB device address
/* USBFS_FS DEVICE USB_STATUS */
/* USB_MIS_ST */
#define   USBFS_MIS_ST           (USBFS_FS->MIS_ST)     // USB miscellaneous status
#define     USBFS_UMS_SOF_PRES     0x80      // RO, indicate host SOF timer presage status
#define     USBFS_UMS_SOF_ACT      0x40      // RO, indicate host SOF timer action status for USB host
#define     USBFS_UMS_SIE_FREE     0x20      // RO, indicate USB SIE free status
#define     USBFS_UMS_R_FIFO_RDY   0x10      // RO, indicate USB receiving FIFO ready status (not empty)
#define     USBFS_UMS_BUS_RESET    0x08      // RO, indicate USB bus reset status
#define     USBFS_UMS_SUSPEND      0x04      // RO, indicate USB suspend status
#define     USBFS_UMS_DM_LEVEL     0x02      // RO, indicate UDM level saved at device attached to USB host
#define     USBFS_UMS_DEV_ATTACH   0x01      // RO, indicate device attached status on USB host
/* USB_INT_FG */
#define   USBFS_INT_FG           (USBFS_FS->INT_FG)    // USB interrupt flag
#define     USBFS_U_IS_NAK         0x80    // RO, indicate current USB transfer is NAK received
#define     USBFS_U_TOG_OK         0x40    // RO, indicate current USB transfer toggle is OK
#define     USBFS_U_SIE_FREE       0x20    // RO, indicate USB SIE free status
#define     USBFS_UIF_FIFO_OV      0x10    // FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear
#define     USBFS_UIF_HST_SOF      0x08    // host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear
#define     USBFS_UIF_SUSPEND      0x04    // USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear
#define     USBFS_UIF_TRANSFER     0x02    // USB transfer completion interrupt flag, direct bit address clear or write 1 to clear
#define     USBFS_UIF_DETECT       0x01    // device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear
#define     USBFS_UIF_BUS_RST      0x01    // bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear
/* USB_INT_ST */
#define   USBFS_INT_ST           (USBFS_FS->INT_ST)    // USB interrupt flag
#define     USBFS_UIS_IS_SETUP     0x80      // RO, indicate current USB transfer is setup received for USB device mode
#define     USBFS_UIS_IS_NAK       0x80      // RO, indicate current USB transfer is NAK received for USB device mode
#define     USBFS_UIS_TOG_OK       0x40      // RO, indicate current USB transfer toggle is OK
#define     USBFS_UIS_TOKEN1       0x20      // RO, current token PID code bit 1 received for USB device mode
#define     USBFS_UIS_TOKEN0       0x10      // RO, current token PID code bit 0 received for USB device mode
#define     USBFS_UIS_TOKEN_MASK   0x30      // RO, bit mask of current token PID code received for USB device mode
#define     USBFS_UIS_TOKEN_OUT    0x00
#define     USBFS_UIS_TOKEN_IN     0x20
#define     USBFS_UIS_TOKEN_SETUP  0x30
// UIS_TOKEN1 & UIS_TOKEN0: current token PID code received for USB device mode
//   00: OUT token PID received
//   10: IN token PID received
//   11: SETUP token PID received
#define     USBFS_UIS_ENDP_MASK    0x0F      // RO, bit mask of current transfer endpoint number for USB device mode
/* USB_RX_LEN */
#define   USBFS_RX_LEN        (USBFS_FS->Rx_Len)      // USB receiving length
/* USB_BUF_MOD */
#define   USBFS_UEP4_1_MOD    (USBFS_FS->UEP4_1_MOD)  // endpoint 4/1 mode
#define     USBFS_UEP1_RX_EN       0x80      // enable USB endpoint 1 receiving (OUT)
#define     USBFS_UEP1_TX_EN       0x40      // enable USB endpoint 1 transmittal (IN)
#define     USBFS_UEP1_BUF_MOD     0x10      // buffer mode of USB endpoint 1
// UEPn_RX_EN & UEPn_TX_EN & UEPn_BUF_MOD: USB endpoint 1/2/3 buffer mode, buffer start address is UEPn_DMA
//   0 0 x:  disable endpoint and disable buffer
//   1 0 0:  64 bytes buffer for receiving (OUT endpoint)
//   1 0 1:  dual 64 bytes buffer by toggle bit bUEP_R_TOG selection for receiving (OUT endpoint), total=128bytes
//   0 1 0:  64 bytes buffer for transmittal (IN endpoint)
//   0 1 1:  dual 64 bytes buffer by toggle bit bUEP_T_TOG selection for transmittal (IN endpoint), total=128bytes
//   1 1 0:  64 bytes buffer for receiving (OUT endpoint) + 64 bytes buffer for transmittal (IN endpoint), total=128bytes
//   1 1 1:  dual 64 bytes buffer by bUEP_R_TOG selection for receiving (OUT endpoint) + dual 64 bytes buffer by bUEP_T_TOG selection for transmittal (IN endpoint), total=256bytes
#define     USBFS_UEP4_RX_EN       0x08      // enable USB endpoint 4 receiving (OUT)
#define     USBFS_UEP4_TX_EN       0x04      // enable USB endpoint 4 transmittal (IN)
// UEP4_RX_EN & UEP4_TX_EN: USB endpoint 4 buffer mode, buffer start address is UEP0_DMA
//   0 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//   1 0:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 receiving (OUT endpoint), total=128bytes
//   0 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=128bytes
//   1 1:  single 64 bytes buffer for endpoint 0 receiving & transmittal (OUT & IN endpoint)
//           + 64 bytes buffer for endpoint 4 receiving (OUT endpoint) + 64 bytes buffer for endpoint 4 transmittal (IN endpoint), total=192bytes

#define  USBFS_UEP2_3_MOD     (USBFS_FS->UEP2_3_MOD)  // endpoint 2/3 mode
#define     USBFS_UEP3_RX_EN       0x80      // enable USB endpoint 3 receiving (OUT)
#define     USBFS_UEP3_TX_EN       0x40      // enable USB endpoint 3 transmittal (IN)
#define     USBFS_UEP3_BUF_MOD     0x10      // buffer mode of USB endpoint 3
#define     USBFS_UEP2_RX_EN       0x08      // enable USB endpoint 2 receiving (OUT)
#define     USBFS_UEP2_TX_EN       0x04      // enable USB endpoint 2 transmittal (IN)
#define     USBFS_UEP2_BUF_MOD     0x01      // buffer mode of USB endpoint 2

#define  USBFS_UEP5_6_MOD     (USBFS_FS->UEP5_6_MOD)  // endpoint 5/6 mode
#define     USBFS_UEP6_RX_EN       0x80      // enable USB endpoint 6 receiving (OUT)
#define     USBFS_UEP6_TX_EN       0x40      // enable USB endpoint 6 transmittal (IN)
#define     USBFS_UEP6_BUF_MOD     0x10      // buffer mode of USB endpoint 6
#define     USBFS_UEP5_RX_EN       0x08      // enable USB endpoint 5 receiving (OUT)
#define     USBFS_UEP5_TX_EN       0x04      // enable USB endpoint 5 transmittal (IN)
#define     USBFS_UEP5_BUF_MOD     0x01      // buffer mode of USB endpoint 5

