openwch/ch32l103/EVT/EXAM/BLE/BLE_USB/APP/include/ch32f20x_usbfs_device.h
#define  USBFS_UEP7_MOD       (USBFS_FS->UEP7_MOD)  // endpoint 7 mode
#define     USBFS_UEP7_RX_EN       0x08      // enable USB endpoint 7 receiving (OUT)
#define     USBFS_UEP7_TX_EN       0x04      // enable USB endpoint 7 transmittal (IN)
#define     USBFS_UEP7_BUF_MOD     0x01      // buffer mode of USB endpoint 7
/* USB_DMA */
#define  USBFS_UEP0_DMA       (USBFS_FS->UEP0_DMA) // endpoint 0 DMA buffer address
#define  USBFS_UEP1_DMA       (USBFS_FS->UEP1_DMA) // endpoint 1 DMA buffer address
#define  USBFS_UEP2_DMA       (USBFS_FS->UEP2_DMA) // endpoint 2 DMA buffer address
#define  USBFS_UEP3_DMA       (USBFS_FS->UEP3_DMA) // endpoint 3 DMA buffer address
#define  USBFS_UEP4_DMA       (USBFS_FS->UEP4_DMA) // endpoint 4 DMA buffer address
#define  USBFS_UEP5_DMA       (USBFS_FS->UEP5_DMA) // endpoint 5 DMA buffer address
#define  USBFS_UEP6_DMA       (USBFS_FS->UEP6_DMA) // endpoint 6 DMA buffer address
#define  USBFS_UEP7_DMA       (USBFS_FS->UEP7_DMA) // endpoint 7 DMA buffer address
/* USB_EP_CTRL */
#define  USBFS_UEP0_T_LEN     (USBFS_FS->UEP0_TX_LEN)   // endpoint 0 transmittal length
#define  USBFS_UEP0_TX_CTRL   (USBFS_FS->UEP0_TX_CTRL)  // endpoint 0 control
#define  USBFS_UEP0_RX_CTRL   (USBFS_FS->UEP0_RX_CTRL)  // endpoint 0 control

#define  USBFS_UEP1_T_LEN     (USBFS_FS->UEP1_TX_LEN)   // endpoint 1 transmittal length
#define  USBFS_UEP1_TX_CTRL   (USBFS_FS->UEP1_TX_CTRL)  // endpoint 1 control
#define  USBFS_UEP1_RX_CTRL   (USBFS_FS->UEP1_RX_CTRL)  // endpoint 1 control

#define  USBFS_UEP2_T_LEN     (USBFS_FS->UEP2_TX_LEN)   // endpoint 2 transmittal length
#define  USBFS_UEP2_TX_CTRL   (USBFS_FS->UEP2_TX_CTRL)  // endpoint 2 control
#define  USBFS_UEP2_RX_CTRL   (USBFS_FS->UEP2_RX_CTRL)  // endpoint 2 control

#define  USBFS_UEP3_T_LEN     (USBFS_FS->UEP3_TX_LEN)   // endpoint 3 transmittal length
#define  USBFS_UEP3_TX_CTRL   (USBFS_FS->UEP3_TX_CTRL)  // endpoint 3 control
#define  USBFS_UEP3_RX_CTRL   (USBFS_FS->UEP3_RX_CTRL)  // endpoint 3 control

#define  USBFS_UEP4_T_LEN     (USBFS_FS->UEP4_TX_LEN)   // endpoint 4 transmittal length
#define  USBFS_UEP4_TX_CTRL   (USBFS_FS->UEP4_TX_CTRL)  // endpoint 4 control
#define  USBFS_UEP4_RX_CTRL   (USBFS_FS->UEP4_RX_CTRL)  // endpoint 4 control

#define  USBFS_UEP5_T_LEN     (USBFS_FS->UEP5_TX_LEN)   // endpoint 5 transmittal length
#define  USBFS_UEP5_TX_CTRL   (USBFS_FS->UEP5_TX_CTRL)  // endpoint 5 control
#define  USBFS_UEP5_RX_CTRL   (USBFS_FS->UEP5_RX_CTRL)  // endpoint 5 control

#define  USBFS_UEP6_T_LEN     (USBFS_FS->UEP6_TX_LEN)   // endpoint 6 transmittal length
#define  USBFS_UEP6_TX_CTRL   (USBFS_FS->UEP6_TX_CTRL)  // endpoint 6 control
#define  USBFS_UEP6_RX_CTRL   (USBFS_FS->UEP6_RX_CTRL)  // endpoint 6 control

#define  USBFS_UEP7_T_LEN     (USBFS_FS->UEP7_TX_LEN)   // endpoint 7 transmittal length
#define  USBFS_UEP7_TX_CTRL   (USBFS_FS->UEP7_TX_CTRL)  // endpoint 7 control
#define  USBFS_UEP7_RX_CTRL   (USBFS_FS->UEP7_RX_CTRL)  // endpoint 7 control

#define     USBFS_UEP_AUTO_TOG     0x08      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define     USBFS_UEP_R_TOG        0x04      // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define     USBFS_UEP_T_TOG        0x04      // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1

#define     USBFS_UEP_R_RES1       0x02      // handshake response type high bit for USB endpoint X receiving (OUT)
#define     USBFS_UEP_R_RES0       0x01      // handshake response type low bit for USB endpoint X receiving (OUT)
#define     USBFS_UEP_R_RES_MASK   0x03      // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define     USBFS_UEP_R_RES_ACK    0x00
#define     USBFS_UEP_R_RES_TOUT   0x01
#define     USBFS_UEP_R_RES_NAK    0x02
#define     USBFS_UEP_R_RES_STALL  0x03
// RB_UEP_R_RES1 & RB_UEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
#define     USBFS_UEP_T_RES1       0x02      // handshake response type high bit for USB endpoint X transmittal (IN)
#define     USBFS_UEP_T_RES0       0x01      // handshake response type low bit for USB endpoint X transmittal (IN)
#define     USBFS_UEP_T_RES_MASK   0x03      // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define     USBFS_UEP_T_RES_ACK    0x00
#define     USBFS_UEP_T_RES_TOUT   0x01
#define     USBFS_UEP_T_RES_NAK    0x02
#define     USBFS_UEP_T_RES_STALL  0x03
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: TALL (error)

#ifdef  USBFS_HOST
/* USBFS_FS HOST CONTROL&CFG */
/* HOST USB_CTRL */
#define  USBFS_UHOST_CTRL       (USBFS_FS->UDEV_CTRL) // USB host physical prot control
#define     USBFS_UH_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define     USBFS_UH_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define     USBFS_UH_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define     USBFS_UH_LOW_SPEED     0x04      // enable USB port low speed: 0=full speed, 1=low speed
#define     USBFS_UH_BUS_RESET     0x02      // control USB bus reset: 0=normal, 1=force bus reset
#define     USBFS_UH_PORT_EN       0x01      // enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached
/* USB_INT_ST */
#define     USBFS_UIS_H_RES_MASK   0x0F      // RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received
/* USB_BUF_MOD */
#define  USBFS_UH_EP_MOD        USBFS_UEP2_3_MOD               //host endpoint mode
#define    USBFS__UH_EP_TX_EN      0x40      // enable USB host OUT endpoint transmittal
#define    USBFS__UH_EP_TBUF_MOD   0x10      // buffer mode of USB host OUT endpoint
// UH_EP_TX_EN & UH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_T_TOG selection for transmittal (OUT endpoint), total=128bytes
#define    USBFS_UH_EP_RX_EN      0x08      // enable USB host IN endpoint receiving
#define    USBFS_UH_EP_RBUF_MOD   0x01      // buffer mode of USB host IN endpoint
// UH_EP_RX_EN & UH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer start address is UH_RX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for receiving (IN endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_R_TOG selection for receiving (IN endpoint), total=128bytes
/* USB_DMA */
#define  USBFS_UH_RX_DMA       USBFS_UEP2_DMA                // host rx endpoint buffer high address
#define  USBFS_UH_TX_DMA       USBFS_UEP3_DMA                // host tx endpoint buffer high address
/* USB_HOST_SETUP  */
#define  USBFS_UH_SETUP        (*((PUINT16V)(0x50000036))) // host aux setup
#define     USBFS_UH_PRE_PID_EN    0x0400      // USB host PRE PID enable for low speed device via hub
#define     USBFS_UH_SOF_EN        0x04        // USB host automatic SOF enable
#define  USBFS_UH_EP_PID        USBFS_UEP2_T_LEN               // host endpoint and PID
#define     USBFS_UH_TOKEN_MASK    0xF0        // bit mask of token PID for USB host transfer
#define     USBFS_UH_ENDP_MASK     0x0F        // bit mask of endpoint number for USB host transfer

#define  USBFS_UH_RX_CTRL       USBFS_UEP2_RX_CTRL             // host receiver endpoint control
#define     USBFS_UH_R_AUTO_TOG    0x08      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define     USBFS_UH_R_TOG         0x04      // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define     USBFS_UH_R_RES         0x01      // prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions

#define  USBFS_UH_RX_CTRL       USBFS_UEP2_RX_CTRL             // host receiver endpoint control
#define     USBFS_UH_R_AUTO_TOG    0x08      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define     USBFS_UH_R_TOG         0x04      // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define     USBFS_UH_R_RES         0x01      // prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions
#define  USBFS_UH_TX_LEN        USBFS_UEP3_T_LEN               // host transmittal endpoint transmittal length

#define  USBFS_UH_TX_CTRL       USBFS_UEP3_TX_CTRL             // host transmittal endpoint control
#define     USBFS_UH_T_AUTO_TOG    0x08      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define     USBFS_UH_T_TOG         0x04      // prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1
#define     USBFS_UH_T_RES         0x01      // expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions
#endif
#ifdef USB_OTG
#define  USB_OTG_CR          (USBFS_FS->OTG_CR)  // usb otg control
#define     USB_OTG_CR_SESS           0x20               // usb otg control,会话电平使能
#define     USB_OTG_CR_VBUS           0x10               // usb otg control,VBUS电平使能
#define     USB_OTG_CR_OTG_EN         0x08               // usb otg control,OTG功能使能
#define     USB_OTG_CR_IDPU           0x04               // usb otg control,ID引脚上拉
#define     USB_OTG_CR_CHARGEVBUS     0x02               // usb otg control,VBUS充电
#define     USB_OTG_CR_DISCHARGEVBUS  0x01               // usb otg control,VBUS放电

