openwch/ch32l103/EVT/EXAM/BLE/BLE_USB/APP/include/ch32f20x_usbfs_device.h
#define  USB_OTG_SR          (USBFS_FS->OTG_CR)  // usb otg status
#define     USB_OTG_SR_VBUS_VLD       0x01               // usb otg status,A设备VBUS输入电平有效
#define     USB_OTG_SR_SESS_VLD       0x02               // usb otg status,会话有效电平有效标志
#define     USB_OTG_SR_SESS_END       0x04               // usb otg status,会话结束电平有效标志
#define     USB_OTG_SR_ID_DIG         0x08               // usb otg status,ID电平
#endif

/*使用sysclk时钟的情况下，需要用到这些宏定义 */
#define RCC_USBFS_CLK_DIV_1   (0<<22)
#define RCC_USBFS_CLK_DIV_2   (1<<22)
#define RCC_USBFS_CLK_DIV_3   (2<<22)
#define RCC_USBFS_CLK_SRC     ((uint32_t)1<<31)

/******************************************************************************/
/* 设备速度相关宏定义 */
#define DEF_USBD_SPEED_FULL    1
#define DEF_USBD_SPEED_LOW     2

#define DEF_USBD_SPEED         DEF_USBD_SPEED_FULL
/******************************************************************************/
/* 端点大小相关宏定义 */
#if DEF_USBD_SPEED == DEF_USBD_SPEED_FULL
#define DEF_USBD_UEP0_SIZE     64
#define DEF_USBD_MAX_PACK_SIZE 64
#define DEF_USBD_BLK_PACK_SIZE 64
#define DEF_USBD_INT_PACK_SIZE 64
#define DEF_USBD_SYC_PACK_SIZE 1023
#elif DEF_USBD_SPEED == DEF_USBD_SPEED_LOW
#define DEF_USBD_UEP0_SIZE     8
#define DEF_USBD_MAX_PACK_SIZE 8
#define DEF_USBD_BLK_PACK_SIZE 0
#define DEF_USBD_INT_PACK_SIZE 8
#define DEF_USBD_SYC_PACK_SIZE 0
#endif

/* 端点大小定义 */
#define DEF_USB_LS_EP_SIZE     8                                               /* 端点全速模式大小 */
#define DEF_USB_FS_EP_SIZE     64                                              /* 端点全速模式大小 */

/******************************************************************************/
/* 变量外扩 */
extern PUINT8  pEP0_RAM_Addr;                                                  //ep0(64)
extern PUINT8  pEP1_RAM_Addr;                                                  //ep1_out(64)+ep1_in(64)
extern PUINT8  pEP2_RAM_Addr;                                                  //ep2_out(64)+ep2_in(64)
extern PUINT8  pEP3_RAM_Addr;                                                  //ep3_out(64)+ep3_in(64)
extern PUINT8  pEP4_RAM_Addr;                                                  //ep4_out(64)+ep4_in(64)
extern PUINT8  pEP5_RAM_Addr;                                                  //ep5_out(64)+ep5_in(64)
extern PUINT8  pEP6_RAM_Addr;                                                  //ep6_out(64)+ep6_in(64)
extern PUINT8  pEP7_RAM_Addr;                                                  //ep7_out(64)+ep7_in(64)

extern volatile UINT16 USBFS_Endp1_Up_Flag;                                     /* USB2.0高速设备端点1数据上传状态: 0:空闲; 1:正在上传; */
extern volatile UINT8  USBFS_Endp1_Down_Flag;                                   /* USB2.0高速设备端点1下传成功标志 */
extern volatile UINT8  USBFS_Endp1_Down_Len;                                    /* USB2.0高速设备端点1下传长度 */
extern volatile BOOL   USBFS_Endp1_T_Tog;                                       /* USB2.0高速设备端点1发送tog位翻转 */
extern volatile BOOL   USBFS_Endp1_R_Tog;

extern volatile UINT16 USBFS_Endp2_Up_Flag;                                     /* USB2.0高速设备端点2数据上传状态: 0:空闲; 1:正在上传; */
extern volatile UINT16 USBFS_Endp2_Up_LoadPtr;                                  /* USB2.0高速设备端点2数据上传装载偏移 */
extern volatile UINT8  USBFS_Endp2_Down_Flag;                                   /* USB2.0高速设备端点2下传成功标志 */

/******************************************************************************/
/* DMA地址和缓冲区相关宏定义 */
#define pSetupReqPakHD      ((PUSB_SETUP_REQ)pEP0_RAM_Addr)
#define pEP0_DataBuf        (pEP0_RAM_Addr)
#define pEP1_OUT_DataBuf    (pEP1_RAM_Addr)
#define pEP1_IN_DataBuf     (pEP1_RAM_Addr+64)
#define pEP2_OUT_DataBuf    (pEP2_RAM_Addr)
#define pEP2_IN_DataBuf     (pEP2_RAM_Addr+64)
#define pEP3_OUT_DataBuf    (pEP3_RAM_Addr)
#define pEP3_IN_DataBuf     (pEP3_RAM_Addr+64)
#define pEP4_OUT_DataBuf    (pEP4_RAM_Addr)
#define pEP4_IN_DataBuf     (pEP4_RAM_Addr+64)
#define pEP5_OUT_DataBuf    (pEP5_RAM_Addr)
#define pEP5_IN_DataBuf     (pEP5_RAM_Addr+64)
#define pEP6_OUT_DataBuf    (pEP6_RAM_Addr)
#define pEP6_IN_DataBuf     (pEP6_RAM_Addr+64)
#define pEP7_OUT_DataBuf    (pEP7_RAM_Addr)
#define pEP7_IN_DataBuf     (pEP7_RAM_Addr+64)
/******************************************************************************/
/* 端点状态获取宏定义 */
#define EP1_GetINSta()      (R8_UEP1_CTRL&UEP_T_RES_NAK)
#define EP2_GetINSta()      (R8_UEP2_CTRL&UEP_T_RES_NAK)
#define EP3_GetINSta()      (R8_UEP3_CTRL&UEP_T_RES_NAK)
#define EP4_GetINSta()      (R8_UEP4_CTRL&UEP_T_RES_NAK)
#define EP5_GetINSta()      (R8_UEP5_CTRL&UEP_T_RES_NAK)
#define EP6_GetINSta()      (R8_UEP6_CTRL&UEP_T_RES_NAK)
#define EP7_GetINSta()      (R8_UEP7_CTRL&UEP_T_RES_NAK)

/******************************************************************************/
/* 函数声明和外扩 */
extern void DevEP1_OUT_Deal( UINT8 l );
extern void DevEP2_OUT_Deal( UINT8 l );
extern void DevEP3_OUT_Deal( UINT8 l );
extern void DevEP4_OUT_Deal( UINT8 l );
extern void DevEP5_OUT_Deal( UINT8 l );
extern void DevEP6_OUT_Deal( UINT8 l );
extern void DevEP7_OUT_Deal( UINT8 l );

extern void DevEP1_IN_Deal( UINT8 l );
extern void DevEP2_IN_Deal( UINT8 l );
extern void DevEP3_IN_Deal( UINT8 l );
extern void DevEP4_IN_Deal( UINT8 l );
extern void DevEP5_IN_Deal( UINT8 l );
extern void DevEP6_IN_Deal( UINT8 l );
extern void DevEP7_IN_Deal( UINT8 l );

extern void USBDeviceInit( void );
extern void USBFS_Init( void );

extern uint8_t USBSendData(void);

#endif
